Revit 2016 API
AreaLoad.Force Property
Returns the three dimensional force applied to one of the points for the area load.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Syntax
C#
[ObsoleteAttribute("This property is obsolete in Revit 2016. Use Force1, Force2 or Force3 property instead.")]
public XYZ this[
	int index
] { get; }
Visual Basic
<ObsoleteAttribute("This property is obsolete in Revit 2016. Use Force1, Force2 or Force3 property instead.")> _
Public ReadOnly Property Force ( _
	index As Integer _
) As XYZ
	Get
Visual C++
[ObsoleteAttribute(L"This property is obsolete in Revit 2016. Use Force1, Force2 or Force3 property instead.")]
public:
property XYZ^ Force[int index] {
	XYZ^ get (int index);
}
Parameters
index
Type: System.Int32
The index of the point to return.
Remarks
The index should be between 0 and less than NumRefPoints. The force is measured in Kg / Sec*Feet.
See Also
AreaLoad Class
Autodesk.Revit.DB.Structure Namespace